      *================================================================*
       IDENTIFICATION                                          DIVISION.
      *================================================================*
       PROGRAM-ID. VARIAVEIS-GRUPOS.

      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************

      *================================================================*
       DATA                                                    DIVISION.
      *================================================================*
      *----------------------------------------------------------------*
       FILE                                            SECTION.
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
       WORKING-STORAGE                                 SECTION.
      *----------------------------------------------------------------*

       77  WRK-VALOR           PIC 9(2)   VALUE 10.


      *================================================================*
       PROCEDURE                                               DIVISION.
      *================================================================*

           ADD 1100 TO WRK-VALOR

               ON SIZE ERROR
                   DISPLAY "SIZE ERROR"

               IF WRK-VALOR > 10 THEN
                   DISPLAY "SIM"
               END-IF

           END-ADD.

           STOP RUN.

       END PROGRAM VARIAVEIS-GRUPOS.
