      *================================================================*
       IDENTIFICATION                                          DIVISION.
      *================================================================*
       PROGRAM-ID. VARIAVEIS-GRUPOS.

      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************

      *================================================================*
       DATA                                                    DIVISION.
      *================================================================*
      *----------------------------------------------------------------*
       FILE                                            SECTION.
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
       WORKING-STORAGE                                 SECTION.
      *----------------------------------------------------------------*

       77  WRK-HORA           PIC X(40).




      *================================================================*
       PROCEDURE                                               DIVISION.
      *================================================================*

           ACCEPT WRK-HORA FROM TIME.



           DISPLAY "HORARIO: " WRK-HORA.

           STOP RUN.

       END PROGRAM VARIAVEIS-GRUPOS.
