      *================================================================*
       IDENTIFICATION                                  DIVISION.
      *================================================================*
       PROGRAM-ID. PROG000X.
       AUTHOR.     HUDSON-RODRIGO-PEDROSO-JUNIOR.

      *================================================================*
       ENVIRONMENT                                     DIVISION.
      *================================================================*
      *----------------------------------------------------------------*
       CONFIGURATION                           SECTION.
      *----------------------------------------------------------------*

       SPECIAL-NAMES.

      *----------------------------------------------------------------*
       INPUT-OUTPUT                            SECTION.
      *----------------------------------------------------------------*

       FILE-CONTROL.
      *    Relaciona arquivo interno a arquivo externo, exemplo:
      *    SELECT ARQV000X ASSIGN TO ARQV0001.

      *================================================================*
       DATA                                            DIVISION.
      *================================================================*
      *----------------------------------------------------------------*
       FILE                                    SECTION.
      *    configuração de layout dos registros de arquivos.
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
       WORKING-STORAGE                         SECTION.
      *    Variáveis devem ser declaradas aqui.
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
       LINKAGE                                 SECTION.
      *    Comunicação entre Programas.
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
       SCREEN                                  SECTION.
      *    Definição de Telas.
      *----------------------------------------------------------------*
      *================================================================*
       PROCEDURE                                       DIVISION.
      *================================================================*

       MAIN-PROCEDURE.
            DISPLAY 1+2
            STOP RUN.
       END PROGRAM PROG000X.
